// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine ("Введите трехзначное число: ");
// int Number = Convert.ToInt32(Console.ReadLine());

// if(Number > 1000 || Number < 100)
// {
//     Console.WriteLine("Введено не трёхзначное число" );
// }

// else
// {
//    Number = (Number/10) % 10;
//    Console.WriteLine("Число " + Number ); 
// }



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6


// Console.WriteLine ("Введите трехзначное число: ");
// int Number = Convert.ToInt32(Console.ReadLine());

// if(Number > 99 && Number < 999){
//     Number = Number % 10;
//     Console.WriteLine("Третья цифра: " + Number);
// }
// else 
// {
//     Console.WriteLine("Третьей цифры нет" );
// }



// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine ("Введите число: ");
// int Number = Convert.ToInt32(Console.ReadLine());

// if (Number > 5)
// {
//     Console.WriteLine("Выходной день" );
// }
// if (Number < 6)
// {
//     Console.WriteLine("Рабочий день" );
// }

